export default function AboutPage() {
  return (
    <>
      <div className="container">
        <h2>Про сайт</h2>
      </div>
      <section className="purpose">
        <div className="container">
          <h3>Мета</h3>
          <p>My Top Words — це система, призначена для ефективного та зручного вивчення німецької лексики. Вона пропонує користувачам вправи на переклад, що дозволяють вивчати не окремі слова, а цілі фрази. Це дає змогу користувачу використовувати нове слово одразу після його вивчення, адже воно було вивчене в контексті.</p>
          <p>Існує приблизна статистика, згідно з якою <strong>для розуміння 85% певної мови достатньо знати 3000 найбільш уживаних слів, а знання 5000 найуживаніших слів забезпечує розуміння 98% цієї мови.</strong> Звичайно, носії мови мають більш розвинений словниковий запас, але основна ціль при вивченні мови — це якомога швидше навчитися розуміти більшість того, що говориться, і самому стати зрозумілим, а для досягнення цієї мети 5000 слів цілком достатньо.</p>
          <p>Тому основна мета цього сайту в тому, щоб допомогти вивчити таку кількість слів якомога швидше, і так, щоб в результаті людина була здатна не тільки розуміти слово на слух, але й вміти правильно застосувати у своєму мовленні.</p>
        </div>
      </section>

      <section className="features">
        <div className="container">
          <h3>Особливості сайту</h3>
          <ul>
            <li>База з близько 5000 найуживаніших слів та речень, які забезпечують розуміння величезного відсотку німецької мови.</li>
            <li>Зручна панель керування особистими наборами лексики.</li>
            <li>Тренажер для вивчення німецької лексики в контекстіі речення.</li>
            <li>Реалізація в тренажерах принципу "інтенсивного повторення", де тренажер нагадує користувачу ті слова, які він ледь встиг забути.</li>
          </ul>
        </div>
      </section>

      <section className="contacts">
        <div className="container">
          <h3>Контакти автора</h3>
          <address>
            <ul>
              <li><b>Ім'я:</b> Сергій</li>
              <li><b>Telegram:</b> <a href="https://t.me/qmaoz" target="_blank" rel="noopener">@qmaoz</a></li>
              <li><b>Email:</b> <a href="mailto:sergeygord1231@gmail.com">sergeygord1231@gmail.com</a></li>
            </ul>
          </address>
        </div>
      </section>
    </>
  );
}